micahjp5158/stm32-projects/hardware-files/stm32f407vg_registers.h
/*
 * stm32f407vg_registers.h
 *
 * Defines macros for all STM32F407VG registers.
 */

/**************** Base Addresses ****************/
#define FSMC_BASE_ADDR          0xA0000000UL
#define RNG_BASE_ADDR           0x50060800UL
#define HASH_BASE_ADDR          0x50060400UL
#define CRYP_BASE_ADDR          0x50060000UL
#define DCMI_BASE_ADDR          0x50050000UL
#define USB_OTG_FS_BASE_ADDR    0x50000000UL
#define USB_OTG_HS_BASE_ADDR    0x40040000UL
#define DMA2D_BASE_ADDR         0x4002B000UL
#define ETHERNET_MAC_BASE_ADDR  0x40028000UL
#define DMA2_BASE_ADDR          0x40026400UL
#define DMA1_BASE_ADDR          0x40026000UL
#define BKPSRAM_BASE_ADDR       0x40024000UL
#define FLASH_INTF_BASE_ADDR    0x40023C00UL
#define RCC_BASE_ADDR           0x40023800UL
#define CRC_BASE_ADDR           0x40023000UL
#define GPIOK_BASE_ADDR         0x40022800UL
#define GPIOJ_BASE_ADDR         0x40022400UL
#define GPIOI_BASE_ADDR         0x40022000UL
#define GPIOH_BASE_ADDR         0x40021C00UL
#define GPIOG_BASE_ADDR         0x40021800UL
#define GPIOF_BASE_ADDR         0x40021400UL
#define GPIOE_BASE_ADDR         0x40021000UL
#define GPIOD_BASE_ADDR         0x40020C00UL
#define GPIOC_BASE_ADDR         0x40020800UL
#define GPIOB_BASE_ADDR         0x40020400UL
#define GPIOA_BASE_ADDR         0x40020000UL
#define LCD_TFT_BASE_ADDR       0x40016800UL
#define SAI1_BASE_ADDR          0x40015800UL
#define SPI6_BASE_ADDR          0x40015400UL
#define SPI5_BASE_ADDR          0x40015000UL
#define TIM11_BASE_ADDR         0x40014800UL
#define TIM10_BASE_ADDR         0x40014400UL
#define TIM9_BASE_ADDR          0x40014000UL
#define EXTI_BASE_ADDR          0x40013C00UL
#define SYSCFG_BASE_ADDR        0x40013800UL
#define SPI4_BASE_ADDR          0x40013400UL
#define SPI1_BASE_ADDR          0x40013000UL
#define SDIO_BASE_ADDR          0x40012C00UL
#define ADC_BASE_ADDR           0x40012000UL
#define USART6_BASE_ADDR        0x40011400UL
#define USART1_BASE_ADDR        0x40011000UL
#define TIM8_BASE_ADDR          0x40010400UL
#define TIM1_BASE_ADDR          0x40010000UL
#define UART8_BASE_ADDR         0x40007C00UL
#define UART7_BASE_ADDR         0x40007800UL
#define DAC_BASE_ADDR           0x40007400UL
#define PWR_BASE_ADDR           0x40007000UL
#define CAN2_BASE_ADDR          0x40006800UL
#define CAN1_BASE_ADDR          0x40006400UL
#define I2C3_BASE_ADDR          0x40005C00UL
#define I2C2_BASE_ADDR          0x40005800UL
#define I2C1_BASE_ADDR          0x40005400UL
#define UART5_BASE_ADDR         0x40005000UL
#define UART4_BASE_ADDR         0x40004C00UL
#define USART3_BASE_ADDR        0x40004800UL
#define USART2_BASE_ADDR        0x40004400UL
#define I2S3EXT_BASE_ADDR       0x40003400UL
#define IWDG_BASE_ADDR          0x40003000UL
#define WWDG_BASE_ADDR          0x40002C00UL
#define RTC_BKP_BASE_ADDR       0x40002800UL
#define TIM14_BASE_ADDR         0x40002000UL
#define TIM14_BASE_ADDR         0x40001C00UL
#define TIM14_BASE_ADDR         0x40001800UL
#define TIM14_BASE_ADDR         0x40001400UL
#define TIM14_BASE_ADDR         0x40001000UL
#define TIM14_BASE_ADDR         0x40000C00UL
#define TIM14_BASE_ADDR         0x40000800UL
#define TIM14_BASE_ADDR         0x40000400UL
#define TIM14_BASE_ADDR         0x40000000UL

/************** End Base Addresses **************/

/************** End Base Addresses **************/